import { Overview } from '../types/overview';
import { v4 as uuidv4 } from 'uuid';

export const overviews: Overview[] = [
  {
    raiting: 9.2,
    discription: 'Инженер-изобретатель Тимофеев сконструировал машину времени, которая соединила его квартиру с далеким шестнадцатым веком - точнее, с палатами государя Ивана Грозного. Туда-то и попадают тезка царя пенсионер-общественник Иван Васильевич Бунша и квартирный вор Жорж Милославский.На их место в двадцатом веке «переселяется» великий государь. Поломка машины приводит ко множеству неожиданных и забавных событий...',
    director: 'Леонид Гайдай',
    starring: 'Александр Демьяненко, Юрий Яковлев, Леонид Куравлёв, Наталья Крачковская',
    id: uuidv4(),
  },
  {
    raiting: 8.2,
    discription: 'Бухгалтер Энди Дюфрейн обвинён в убийстве собственной жены и её любовника. Оказавшись в тюрьме под названием Шоушенк, он сталкивается с жестокостью и беззаконием, царящими по обе стороны решётки. Каждый, кто попадает в эти стены, становится их рабом до конца жизни. Но Энди, обладающий живым умом и доброй душой, находит подход как к заключённым, так и к охранникам, добиваясь их особого к себе расположения.',
    director: 'Фрэнк Дарабонт',
    starring: 'Тим Роббинс, Морган Фриман, Боб Гантон, Уильям Сэдлер',
    id: uuidv4(),
  },
  {
    raiting: 7.2,
    discription: 'Пол Эджкомб — начальник блока смертников в тюрьме «Холодная гора», каждый из узников которого однажды проходит «зеленую милю» по пути к месту казни. Пол повидал много заключённых и надзирателей за время работы. Однако гигант Джон Коффи, обвинённый в страшном преступлении, стал одним из самых необычных обитателей блока.',
    director: 'Фрэнк Дарабонт',
    starring: 'Том Хэнкс, Дэвид Морс, Бонни Хант, Майкл Кларк Дункан, Джеймс Кромуэлл',
    id: uuidv4(),
  },
  {
    raiting: 9.7,
    discription: 'Демобилизовавшись, Данила Багров вернулся в родной городок. Но скучная жизнь российской провинции не устраивала его, и он решился податься в Петербург, где, по слухам, уже несколько лет процветает его старший брат. Данила нашел брата. Но все оказалось не так просто — брат работает наемным убийцей.',
    director: 'Алексей Балабанов',
    starring: 'Сергей Бодров мл., Виктор Сухоруков, Светлана Письмиченко, Мария Милютина, Юрий Кузнецов, Сергей Мурзин, Ирина Ракшина',
    id: uuidv4(),
  },
  {
    raiting: 9.1,
    discription: 'Фильм основан на реальной истории, происшедшей в 1999 году в Ричмонде, штат Калифорния. Тренер школьной команды по баскетболу Кен Картер принял в середине сезона беспрецедентное решение, запретив игрокам, не испытавшим еще ни одного поражения, выходить на площадку из-за низкой успеваемости в школе. В итоге команда пропустила две игры в чемпионате, а юным баскетболистам был закрыт доступ в спортзал до тех пор, пока они не стали хорошо учиться. Поступок Картера вызвал одновременно и одобрение, и резкую критику со стороны родителей игроков и школьного руководства. Среди членов команды был и сын тренера, поступивший впоследствии в престижное учебное заведение.',
    director: 'Томас Картер',
    starring: 'Сэмюэл Л. Джексон, Роб Браун, Роберт Ричард, Рик Гонсалес, Нана Гбивонио',
    id: uuidv4(),
  },
  {
    raiting: 7.2,
    discription: 'Москва. 1924 год. В результате одного из своих сложнейших опытов, профессор Филипп Филиппович Преображенский делает потрясающее открытие: после пересадки гипофиза его подопытный пёс Шарик превращается в человека! Сенсационная новость мгновенно разлетелась по Москве, и принесла всемирно известному профессору очередную порцию признания. Однако радость его была недолгой: вопрос о том, что из Шарика - в последствии гражданина Шарикова - может получиться «высокая психическая личность» очень быстро становится под сомнение.',
    director: 'Владимир Бортко',
    starring: 'Владимир Толоконников, Евгений Евстигнеев, Борис Плотников, Роман Карцев, Нина Русланова',
    id: uuidv4(),
  },
  {
    raiting: 8.3,
    discription: 'Фильм снят по автобиографии Владислава Шпильмана, одного из лучших пианистов Польши 30-х годов прошлого века. Главный герой фильма — Владек — занимается искусством до тех пор, пока территорию Польши не занимают нацисты. Жизнь всех евреев меняется: их помещают в Варшавское гетто, запрещают работать, унижают, заставляют носить отличительные повязки, а через некоторое время отправляют в концлагерь.',
    director: 'Роберт Земекис',
    starring: 'Эдриан Броуди, Эмилия Фокс, Даниэль Кальтаджироне, Эд Стоппард, Морин Липман',
    id: uuidv4(),
  },
  {
    raiting: 7.9,
    discription: 'В основе сюжета - реальная история, случившаяся в Японии и потрясшая весь мир. Однажды, возвращаясь с работы, профессор колледжа нашел на вокзале симпатичного щенка породы акита-ину. Профессор и Хатико стали верными друзьями. Каждый день пес провожал и встречал Профессора на вокзале. И даже потеря хозяина не остановила пса в его надежде, что друг вернется.',
    director: 'Роберт Земекис',
    starring: 'Ричард Гир, Джоан Аллен, Кэри-Хироюки Тагава, Сара Ремер, Джейсон Александер',
    id: uuidv4(),
  },
];
